{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "conv1/kernel", "shape": [3, 3, 3, 24], "dtype": "float32"}, {"name": "conv1_bn/gamma", "shape": [24], "dtype": "float32"}, {"name": "conv1_bn/beta", "shape": [24], "dtype": "float32"}, {"name": "conv1_bn/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "conv1_bn/moving_variance", "shape": [24], "dtype": "float32"}, {"name": "conv_dw_1/depthwise_kernel", "shape": [3, 3, 24, 1], "dtype": "float32"}, {"name": "conv_dw_1_bn/gamma", "shape": [24], "dtype": "float32"}, {"name": "conv_dw_1_bn/beta", "shape": [24], "dtype": "float32"}, {"name": "conv_dw_1_bn/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "conv_dw_1_bn/moving_variance", "shape": [24], "dtype": "float32"}, {"name": "conv_pw_1/kernel", "shape": [1, 1, 24, 48], "dtype": "float32"}, {"name": "conv_pw_1_bn/gamma", "shape": [48], "dtype": "float32"}, {"name": "conv_pw_1_bn/beta", "shape": [48], "dtype": "float32"}, {"name": "conv_pw_1_bn/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "conv_pw_1_bn/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "conv_dw_2/depthwise_kernel", "shape": [3, 3, 48, 1], "dtype": "float32"}, {"name": "conv_dw_2_bn/gamma", "shape": [48], "dtype": "float32"}, {"name": "conv_dw_2_bn/beta", "shape": [48], "dtype": "float32"}, {"name": "conv_dw_2_bn/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "conv_dw_2_bn/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "conv_pw_2/kernel", "shape": [1, 1, 48, 96], "dtype": "float32"}, {"name": "conv_pw_2_bn/gamma", "shape": [96], "dtype": "float32"}, {"name": "conv_pw_2_bn/beta", "shape": [96], "dtype": "float32"}, {"name": "conv_pw_2_bn/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "conv_pw_2_bn/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "conv_dw_3/depthwise_kernel", "shape": [3, 3, 96, 1], "dtype": "float32"}, {"name": "conv_dw_3_bn/gamma", "shape": [96], "dtype": "float32"}, {"name": "conv_dw_3_bn/beta", "shape": [96], "dtype": "float32"}, {"name": "conv_dw_3_bn/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "conv_dw_3_bn/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "conv_pw_3/kernel", "shape": [1, 1, 96, 96], "dtype": "float32"}, {"name": "conv_pw_3_bn/gamma", "shape": [96], "dtype": "float32"}, {"name": "conv_pw_3_bn/beta", "shape": [96], "dtype": "float32"}, {"name": "conv_pw_3_bn/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "conv_pw_3_bn/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "conv_dw_4/depthwise_kernel", "shape": [3, 3, 96, 1], "dtype": "float32"}, {"name": "conv_dw_4_bn/gamma", "shape": [96], "dtype": "float32"}, {"name": "conv_dw_4_bn/beta", "shape": [96], "dtype": "float32"}, {"name": "conv_dw_4_bn/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "conv_dw_4_bn/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "conv_pw_4/kernel", "shape": [1, 1, 96, 192], "dtype": "float32"}, {"name": "conv_pw_4_bn/gamma", "shape": [192], "dtype": "float32"}, {"name": "conv_pw_4_bn/beta", "shape": [192], "dtype": "float32"}, {"name": "conv_pw_4_bn/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "conv_pw_4_bn/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "conv_dw_5/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "conv_dw_5_bn/gamma", "shape": [192], "dtype": "float32"}, {"name": "conv_dw_5_bn/beta", "shape": [192], "dtype": "float32"}, {"name": "conv_dw_5_bn/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "conv_dw_5_bn/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "conv_pw_5/kernel", "shape": [1, 1, 192, 192], "dtype": "float32"}, {"name": "conv_pw_5_bn/gamma", "shape": [192], "dtype": "float32"}, {"name": "conv_pw_5_bn/beta", "shape": [192], "dtype": "float32"}, {"name": "conv_pw_5_bn/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "conv_pw_5_bn/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "conv_dw_6/depthwise_kernel", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "conv_dw_6_bn/gamma", "shape": [192], "dtype": "float32"}, {"name": "conv_dw_6_bn/beta", "shape": [192], "dtype": "float32"}, {"name": "conv_dw_6_bn/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "conv_dw_6_bn/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "conv_pw_6/kernel", "shape": [1, 1, 192, 384], "dtype": "float32"}, {"name": "conv_pw_6_bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_6_bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_6_bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_6_bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_7/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"}, {"name": "conv_dw_7_bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_7_bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_7_bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_7_bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_7/kernel", "shape": [1, 1, 384, 384], "dtype": "float32"}, {"name": "conv_pw_7_bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_7_bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_7_bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_7_bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_8/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"}, {"name": "conv_dw_8_bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_8_bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_8_bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_8_bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_8/kernel", "shape": [1, 1, 384, 384], "dtype": "float32"}, {"name": "conv_pw_8_bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_8_bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_8_bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_8_bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_9/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"}, {"name": "conv_dw_9_bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_9_bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_9_bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_9_bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_9/kernel", "shape": [1, 1, 384, 384], "dtype": "float32"}, {"name": "conv_pw_9_bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_9_bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_9_bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_9_bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_10/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"}, {"name": "conv_dw_10_bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_10_bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_10_bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_10_bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_10/kernel", "shape": [1, 1, 384, 384], "dtype": "float32"}, {"name": "conv_pw_10_bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_10_bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_10_bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_10_bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_11/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"}, {"name": "conv_dw_11_bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_11_bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_11_bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_11_bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_11/kernel", "shape": [1, 1, 384, 384], "dtype": "float32"}, {"name": "conv_pw_11_bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_11_bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_11_bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_11_bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_12/depthwise_kernel", "shape": [3, 3, 384, 1], "dtype": "float32"}, {"name": "conv_dw_12_bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_12_bn/beta", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_12_bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "conv_dw_12_bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "conv_pw_12/kernel", "shape": [1, 1, 384, 768], "dtype": "float32"}, {"name": "conv_pw_12_bn/gamma", "shape": [768], "dtype": "float32"}, {"name": "conv_pw_12_bn/beta", "shape": [768], "dtype": "float32"}, {"name": "conv_pw_12_bn/moving_mean", "shape": [768], "dtype": "float32"}, {"name": "conv_pw_12_bn/moving_variance", "shape": [768], "dtype": "float32"}, {"name": "conv_dw_13/depthwise_kernel", "shape": [3, 3, 768, 1], "dtype": "float32"}, {"name": "conv_dw_13_bn/gamma", "shape": [768], "dtype": "float32"}, {"name": "conv_dw_13_bn/beta", "shape": [768], "dtype": "float32"}, {"name": "conv_dw_13_bn/moving_mean", "shape": [768], "dtype": "float32"}, {"name": "conv_dw_13_bn/moving_variance", "shape": [768], "dtype": "float32"}, {"name": "conv_pw_13/kernel", "shape": [1, 1, 768, 768], "dtype": "float32"}, {"name": "conv_pw_13_bn/gamma", "shape": [768], "dtype": "float32"}, {"name": "conv_pw_13_bn/beta", "shape": [768], "dtype": "float32"}, {"name": "conv_pw_13_bn/moving_mean", "shape": [768], "dtype": "float32"}, {"name": "conv_pw_13_bn/moving_variance", "shape": [768], "dtype": "float32"}, {"name": "conv_preds/kernel", "shape": [1, 1, 768, 1000], "dtype": "float32"}, {"name": "conv_preds/bias", "shape": [1000], "dtype": "float32"}]}]}